/**
 *	数据类型	占用空间	取值范围
 *	char		1字节		-128到 127(-27 ~ 27-1)
 * 	unsigned char	1字节		0 到 255(0 ~ 28-1)
 * */
#include <stdio.h>

int main()
{
	char ch;
	printf("符号位溢出会导致数的正负发生改变\n");
	ch = 0x7f +2; 	//127+2
	printf("0x7f+2 = %d\n", ch);
	//	0111 1111
	//+2后 1000 0001，这是负数补码，其原码为 1111 1111，结果为-127
	
	unsigned char ch2;
	ch2 = 0xff+1; 	//255+1
	printf("0xff+1 = %u\n", ch2);
	//	  1111 1111
	//+1后 10000 0000， char只有8位最高位的溢出，结果为0000 0000，十进制为0
	
	ch2 = 0xff+2;	//255+2
	printf("0xff+2 = %u\n", ch2);
	//	  1111 1111
	//+1后 10000 0001， char只有8位最高位的溢出，结果为0000 0001，十进制为1

	return 0;
}
